aaron-bond.better-comments
adityabaradwaj.copy-python-path-remote
alefragnani.project-manager
batisteo.vscode-django
christian-kohler.path-intellisense
cschlosser.doxdocgen
DavidAnson.vscode-markdownlint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
EditorConfig.EditorConfig
emeraldwalk.RunOnSave
equinusocio.vsc-material-theme-icons
eriklynd.json-tools
esbenp.prettier-vscode
formulahendry.code-runner
GitHub.codespaces
GitHub.remotehub
GitHub.vscode-pull-request-github
hbenl.vscode-test-explorer
henriiik.docker-linter
huizhou.githd
iterative.dvc
JillMNolan.python-essentials
KevinRose.vsc-python-indent
littlefoxteam.vscode-python-test-adapter
maattdd.gitless
magicstack.Chromodynamics
magicstack.MagicPython
mgesbert.python-path
mhutchie.git-graph
mintlify.document
mohsen1.prettify-json
ms-azuretools.vscode-docker
MS-CEINTL.vscode-language-pack-ko
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-powertoys
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
njpwerner.autodocstring
njqdev.vscode-python-typehint
oderwat.indent-rainbow
p1c2u.docker-compose
PKief.material-icon-theme
redhat.vscode-yaml
ruiquelhas.vscode-uppercase
Shan.code-settings-sync
shardulm94.trailing-spaces
shd101wyy.markdown-preview-enhanced
spywhere.guides
streetsidesoftware.code-spell-checker
Tyriar.sort-lines
usernamehw.errorlens
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
yzhang.markdown-all-in-one
ZainChen.json
zeshuaro.vscode-python-poetry
